Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: Les probabilitats d'aquestes operacions depenen dels segments concrets que s'estan reordenant i són tres: traducció monòtona (quan no hi ha reordenament), reordenament (quan la posició de la traducció del segment en qüestió i la de l'anterior s'intercanvien) i traducció discontinua (qual la traducció del segment es mou a una altra posició en l'oració en LM; es a dir, quan no és cap de les altres dues operacions).
es_es: Las probabilidades de estas operaciones dependen de los segmentos concretos que se están reordenando y son tres: traducción monótona (cuando no hay reordenamiento), reordenamiento (cuando la posición de la traducción del segmento en cuestión y la del anterior se intercambian) y traducción discontinua (cuando la traducción del segmento se mueve a otra posición en la oración en LM; es decir, cuando no es ninguna de las otras dos operaciones).

source: Les referències que s'han fet en l'epígraf al propòsit o motivació de la traducció i a la tipologia dels documents que han de ser traduïts són també molt importants a l'hora d'analitzar la traducció automàtica.
es_es: Las referencias que se han hecho en el epígrafe al propósito o motivación de la traducción y a la tipología de los documentos que tienen que ser traducidos son también muy importantes a la hora de analizar la traducción automática.

source: Les regles de l'anglés controlat, poden dependre del sistema de TA elegit?
es_es: Las reglas del inglés controlado, ¿pueden depender del sistema de TA elegido?

source: Les regles es podrien formular com segueix en espanyol: { [escondite] úsese sólo en el sentido de ``juego del escondite''; úsese escondrijo si se quiere indicar el lugar donde se esconde alguna persona o cosa.
es_es: Las reglas se podrían formular como sigue en español: { [escondite] úsese sólo en el sentido de ``juego del escondite''; úsese escondrijo si se quiere indicar el lugar donde se esconde alguna persona o cosa.

source: Les regles que formuleu per als autors que escriguen en el llenguatge controlat han de estar escrites en $L$ i no han de contenir referències a altres llengües.
es_es: Las reglas que formuláis para los autores que escriban en el lenguaje controlado tienen que estar escritas en $L$ y no tienen que contener referencias a otras lenguas.

source: Les regles s'apliquen de la manera usual: d'esquerra a dreta, reordenant la seqüència més llarga possible, i sense que se solapen les àrees reordenades.
es_es: Las reglas se aplican de la manera usual: de izquierda a derecha, reordenando la secuencia más larga posible, y sin que se solapen las áreas reordenadas.

source: Les regles solen correspondre's normalment amb els subarbres bàsics amb els quals es construeixen els arbres d'anàlisi sintàctica de totes les frases sintàcticament acceptables; és a dir, aquestes regles especifiquen com es pot construir un sintagma o { constituent} a partir d'altres sintagmes i de categories lèxiques.
es_es: Las reglas suelen corresponderse normalmente con los subárboles básicos con los que se construyen los árboles de análisis sintáctico de todas las frases sintácticamente aceptables; es decir, estas reglas especifican cómo se puede construir un sintagma o { constituyente} a partir de otros sintagmas y de categorías léxicas.

source: Les representacions abstractes apropen les dues llengües eliminant-ne alguns detalls específics i destacant característiques generals que poden així ser tractades més fàcilment pel mòdul de transferència.
es_es: Las representaciones abstractas acercan las dos lenguas eliminando algunos detalles específicos y destacando características generales que pueden así ser tratadas más fácilmente por el módulo de transferencia.

source: Les restriccions es poden expressar sota la forma de missatges interactius dirigits a la persona que prepara el document original.
es_es: Las restricciones se pueden expresar bajo la forma de mensajes interactivos dirigidos a la persona que prepara el documento original.

source: Les traduccions observades es poden explicar amb les tres regles següents: $R_1$: { cuyo} { n} $$ { art} { n} { de} { art} { qual} $R_2$: { cuyo} { n}$_1$ { de} { n}$_2$ $$ { art} { n}$_1$ { de} { n}$_2$ { de} { art} { qual} $R_3$: { cuyo} { n} { adj} $$ { art} { n} { adj} { de} { art} { qual} Les regles que s'apliquen en cada cas són: $R_1$ $R_2$ $R_3$ $R_2$; no abraça el segment de francés i trenca el sintagma; $R_3$; no abraça el segment de clase i trenca el sintagma; $R_3$; no abraça el segment de clase de francés i trenca el sintagma.
es_es: Las traducciones observadas se pueden explicar con las tres reglas siguientes: $R_1$: { cuyo} { n} $$ { art} { n} { de} { art} { qual} $R_2$: { cuyo} { n}$_1$ { de} { n}$_2$ $$ { art} { n}$_1$ { de} { n}$_2$ { de} { art} { que} $R_3$: { cuyo} { n} { adj} $$ { art} { n} { adj} { de} { art} { qual} Las reglas que se aplican en cada caso son: $R_1$ $R_2$ $R_3$ $R_2$; no abarca el segmento de francés y rompe el sintagma; $R_3$; no abarca el segmento de clase y rompe el sintagma; $R_3$; no abarca el segmento de clase de francés y rompe el sintagma.

source: LetTrans és un sistema d'interlingua: per a afegir el suahili només es necessiten experts en suahili i en la interlingua de LetTrans.
es_es: LetTrans es un sistema de interlingua: para añadir el suahili sólo se necesitan expertos en suahili y en la interlingua de LetTrans.

source: Llengua de contacte que es parla a Papua Nova Guinea i que té 50.000 parlants que la parlen com a primera llengua i més de dos milions de parlants que la parlen com a segona llengua.
es_es: La lengua de contacto que se habla en Papua Nueva Guinea y que tiene 50.000 hablantes que la hablan como primera lengua y más de dos millones de hablantes que la hablan como segunda lengua.

source: Moltes de les aplicacions de la traducció automàtica es poden dividir en dos grans grups: l'assimilació d'informació (quan una persona usa la traducció automàtica per a obtenir informació a partir d'un document escrit en una altra llengua) i la disseminació ---també anomenada difusió--- d'informació (quan una persona usa la traducció automàtica per a produir documents que han de ser distribuïts a més d'un usuari).
es_es: Muchas de las aplicaciones de la traducción automática se pueden dividir en dos grandes grupos: la asimilación de información (cuando una persona usa la traducción automática para obtener información a partir de un documento escrito en otra lengua) y la diseminación ---también llamada difusión--- de información (cuando una persona usa la traducción automática para producir documentos que tienen que ser distribuidos a más de un usuario).

source: Moltes situacions de traducció automàtica es poden classificar com a situacions de traducció assistida per ordinador (en anglés computer-aided translation; CAT), també anomenada de vegades traducció semiautomàtica.
es_es: Muchas situaciones de traducción automática se pueden clasificar como situaciones de traducción asistida por ordenador (en inglés computer-aided translation; CAT), también llamada a veces traducción semiautomática.

source: Moltes voltes, la preedició la fa l'autor quan interacciona amb el programa de traducció automàtica.
es_es: Muchas veces, la preedición la hace el autor cuando interacciona con el programa de traducción automática.

source: Molts dels sistemes indirectes basats en regles són sistemes de transferència.
es_es: Muchos de los sistemas indirectos basados en reglas son sistemas de transferencia.

source: Molts investigadors començaven a trobar barreres de tot tipus, especialment semàntiques, que semblaven massa difícils de superar i que exigien mètodes més complexos.
es_es: Muchos investigadores empezaban a encontrar barreras de todo tipo, especialmente semánticas, que parecían demasiado difíciles de superar y que exigían métodos más complejos.

source: Més endavant, en la secció , discutirem sobre la relació entre traducció humana i traducció automàtica.
es_es: Más adelante, en la sección , discutiremos sobre la relación entre traducción humana y traducción automática.

source: Ng{a whare nui o te aroha} (Les cases grans de l'amor) Te hau o te aroha (El vent de l'amor) Ng{a pukapuka o te whare} (El llibre de la casa) Ng{a ingoa o te pukapuka nui} (Els noms del llibre gran) Te ingoa o ng{a whare} (El nom de les cases)
es_es: Ng{a whare nui o te aroha} (Las casas grandes del amor) Te hau o te aroha (El viento del amor) Ng{apukapuka o te whare} (El libro de la casa) Ng{a ingoa o te pukapuka nui} (Los nombres del libro grande) Te ingoa o ng{a whare} (El nombre de las casas)

source: No es busca la perfecció sinó més aviat traduccions en brut ràpides i fàcils d'entendre o de corregir (és a dir, amb pocs errors).
es_es: No se busca la perfección sino más bien traducciones en bruto rápidas y fáciles de entender o de corregir (es decir, con pocos errores).

source: No feia molt que s'havia creat el primer ordinador, quan ja es va començar a pensar en la possibilitat d'usar-los per a traduir llenguatges humans.
es_es: No hacía mucho que se había creado el primer ordenador, cuando ya se empezó a pensar en la posibilidad de usarlos para traducir lenguajes humanos.

source: No ha estat capaç de detectar el patró verb art nom adj prep nompropi i aplica la regla $R_2$ que és la més llarga que concorda.
es_es: No ha sido capaz de detectar el patrón verbo art nombre adj prep nombrepropio y aplica la regla $R_2$ que es la más larga que concuerda.

source: No oblidem que aquesta descripció assumeix que l'ambigüitat lèxica (múltiples interpretacions dels mots) i estructural (més d'un arbre d'anàlisi sintàctica) ha estat idealment resolta.
es_es: No olvidemos que esta descripción asume que la ambigüedad léxica (múltiples interpretaciones de las palabras) y estructural (más de un árbol de análisis sintáctico) ha sido resuelta de forma idónea.

source: No obstant això, algunes veus es pronunciaren en contra del perfeccionisme dominant i defensaren una aproximació més a llarg termini al problema i la construcció de sistemes que feren un ús efectiu de la interacció persona--màquina.
es_es: Sin embargo, algunas voces se pronunciaron en contra del perfeccionismo dominante y defendieron una aproximación más a largo plazo al problema y la construcción de sistemas que hicieron un uso efectivo de la interacción persona-máquina.

source: No obstant això, aquest error no ha afectat a la traducció de la resta de l'oració.
es_es: Sin embargo, este error no ha afectado a la traducción del resto de la oración.

source: No reconeix la seqüència { art}--{ adj}--{ subst}, i tradueix mot per mot.
es_es: No reconoce la secuencia { art}--{ adj}--{ sust} y traduce palabra por palabra.

source: No us preocupeu de la contracció preposició--article.
es_es: No os preocupéis por la contracción preposición--artículo.

source: Només una d'aquestes tres afirmacions és certa.
es_es: Solo una de estas tres afirmaciones es correcta.

source: Normalment es reserva la denominació traducció automàtica per a la completament automàtica; quan s'hi produeix intervenció humana es parla de { traducció assistida per l'ordinador} o de traducció semi-automàtica.
es_es: Normalmente se reserva la denominación traducción automática para la completamente automática; cuando se produce intervención humana se habla de { traducción asistida por ordenador} o de traducción semi-automática.

source: Normalment, els programes tenen un mòdul inicial que podríem anomenar desformatador i un mòdul final que podríem anomenar reformatador i que restitueix les etiquetes de manera que el format i l'estructura del document es conserven tant com siga possible.
es_es: Normalmente, los programas tienen un módulo inicial que podríamos llamar desformateador y un módulo final que podríamos llamar reformateador y que restituyen las etiquetas de manera que el formato y la estructura del documento se conserven tanto como sea posible.

source: Notem que per a aquesta última fase són necessaris diversos experts bilingües en sistemes de transferència. La figura il·lustra el cost d'afegir $L_4$ al sistema de transferència;
es_es: Notamos que para esta última fase son necesarios varios expertos bilingües en sistemas de transferencia. La figura ilustra el coste de añadir $L_4$ al sistema de transferencia;

source: Per a acabar aquest apartat, convé esmentar alguns processos que no s'anomenaran traducció en el context d'aquest llibre: l'adaptació de textos antics a la forma moderna d'un idioma; la traducció de mots i frases quan s'ensenya un nou idioma; la interpretació (de missatges parlats); la codificació (en Morse, etc.).
es_es: Para acabar este apartado, conviene mencionar algunos procesos que no se llamarán traducción en el contexto de este libro: la adaptación de textos antiguos a la forma moderna de un idioma; la traducción de palabras y frases cuando se enseña un idioma nuevo; la interpretación (de mensajes hablados); la codificación (en Morse, etc.).

source: Per a afegir-hi una nova llengua hem escrit 6 mòduls.
es_es: Para añadir una nueva lengua hemos escrito 6 módulos.

source: Per a evitar això s'introdueix un model que compta el nombre de paraules en la hipòtesi de traducció i que fa que tinga relació amb el nombre de paraules de l'oració origen.
es_es: Para evitar esto se introduce un modelo que cuenta el número de palabras en la hipótesis de traducción y que hace que tenga relación con el número de palabras de la oración origen.

source: Per a poder traduir tall truck driver seguint aquest esquema, caldria una regla que combinara \(R_1\) i \(R_2\): [$R_4$] (en) adj subst$_1$ subst$_2$ $$ (ca) subst$_2$ adj prepde subst$_1$
es_es: Para poder traducir tall truck driver siguiendo este esquema, haría falta una regla que combinara \(R_1\) y \(R_2\): [$R_4$] (en) adj sust$_1$ sust$_2$ $$ (ca) sust$_2$ adj prepde sust$_1$

source: Per a preeditar correctament cal conéixer l'idioma de destinació.
es_es: Para preeditar correctamente hay que conocer el idioma de destino.

source: Per a quina aplicació de la informàtica a la traducció podrien servir els resultats d'un estudi numèric com aquest?
es_es: ¿Para qué aplicación de la informática en la traducción podrían servir los resultados de un estudio numérico como este?

source: Per a què usen els sistemes de traducció automàtica estadística el model de llengua?
es_es: ¿Para qué usan los sistemas de traducción automática estadística el modelo de lengua?

source: Per a saber quan ha de desplaçar una categoria lèxica a la pila o quan i com ha de reduir el cim de la pila, té en compte una o més categories lèxiques de les que està a punt de llegir i un o més elements del cim de la pila, i fa l'acció que li indica una taula d'anàlisi sintàctica que es construeix a partir de la gramàtica que s'haja proposat per a la llengua origen i que l'analitzador consulta en cada pas de l'anàlisi.
es_es: Para saber cuándo tiene que desplazar una categoría léxica a la pila o cuándo y cómo tiene que reducir la cumbre de la pila, tiene en cuenta una o más categorías léxicas de las que está a punto de leer y uno o más elementos de la cumbre de la pila, y hace la acción que le indica una tabla de análisis sintáctico que se construye a partir de la gramática que se haya propuesto para la lengua origen y que el analizador consulta en cada paso del análisis.

source: Per a una anàlisi de costos més detallada, vegeu l'apartat .
es_es: Para un análisis de costes más detallado, véase el apartado .

source: Per això mateix, el model mot a mot es pot usar com a model de referència o model zero a l'hora d'estudiar què més fan els sistemes existents, o què més cal fer per a produir traduccions automàtiques útils per a un parell de llengües.
es_es: Por eso mismo, el modelo palabra a palabra se puede usar como modelo de referencia o modelo cero a la hora de estudiar qué más hacen los sistemas existentes, o qué más hay que hacer para producir traducciones automáticas útiles para un par de lenguas.

source: Per altra banda, la part final del processament d'angoixaven i de cantaven seria molt similar, ja que els dos verbs es conjuguen segons el mateix paradigma.
es_es: Por otro lado, la parte final del proceso de angoixaven y de cantaven sería muy similar, ya que los dos verbos se conjugan según el mismo paradigma.

source: Per aquesta època, a més, els sistemes de TA comencen a ser demanats per empreses i administracions i no sols per traduir textos científics i tècnics.
es_es: Por esta época, además, los sistemas de TA empiezan a ser pedidos por empresas y administraciones y no sólo para traducir textos científicos y técnicos.

source: Per començar, s'ha de tenir en compte que el mot traducció és ambigu perquè es pot referir al procés de traduir o al producte (resultat) d'aquest procés.
es_es: Para empezar, hay que tener en cuenta que la palabra traducción es ambigua porque se puede referir al proceso de traducir o al producto (resultado) de este proceso.

source: Per evitar assignar versemblances nul·les a una oració, a més d'utilitzar segments de poques paraules, aquests models també usen tècniques de suavitzat (en anglés smoothing) de les probabilitat.
es_es: Para evitar asignar verosimilitudes nulas a una oración, además de utilizar segmentos de pocas palabras, estos modelos también usan técnicas de suavizado (en inglés smoothing) de las probabilidades.

source: Per exemple, $L_1$=espanyol i $L_2$=català: un buen postre $$ *un bon postres (unes bones postres); una señal inequívoca $$ *una senyal inequívoca (un senyal inequívoc).
es_es: Por ejemplo, $L_1$=español y $L_2$=catalán: un buen postre $$ *un bon postres (unes bones postres); una señal inequívoca $$ *una senyal inequívoca (un senyal inequívoc).

source: Per exemple, carta comercial, edicte municipal, comentari editorial, manual tècnic informàtic o recull de poemes.
es_es: Por ejemplo,carta comercial, edicto municipal, comentario editorial, manual técnico informático o recopilación de poemas.

source: Per exemple, amb les regles $R_1:$ $a n n a$, $R_2:$ $a_1 a_2 n n a_2 a_1$ $R_3:$ $n_1 n_2 n_2 ``de'' n_1$ es tradueixen bé totes excepte la (a) i la (f), que quedarien: ``*Una $[$tardor fosca$]_{R_1}$ nit'' i ``*Una $[$tardor fosca$]_{R_1}$ $[$marea alta$]_{R_1}$'' perquè les regles són incapaces de reconéixer els sintagmes complets.
es_es: Por ejemplo, con las reglas [$R_1:$] $a n n a$, $R_2:$] $a_1 a_2n n a_2 a_1$ $R_3:$] $n_1 n_2 n_2 ``de'' n_1$ se traducen bien todas excepto la (a) y la (f), que quedarían: ``*Una $[$tardor fosca$]_{R_1}$ nit'' y ``*Una $[$tardor fosca$]_{R_1}$ $[$marea alta$]_{R_1}$'' porque las reglas son incapaces de reconocer los sintagmas completos.

source: Per exemple, detectar la seqüència { art}--{ subst} pot servir per propagar el gènere i el nombre del substantiu a l'article.
es_es: Por ejemplo, detectar la secuencia { art}--{ sust} puede servir para propagar el género y el número del sustantivo al artículo.

source: Per exemple, el model de traducció, que s'usa per estimar la probabilitat de què un segment de text en LM siga la traducció d'un segment de text en LO, assumeix que la traducció d'un segment és independent de la traducció de la resta de segments de l'oració; és a dir, assumeix que no cal tenir en compte el context per a traduir cadascun dels segments de l'oració en LO.
es_es: Por ejemplo, el modelo de traducción, que se usa para estimar la probabilidad de que un segmento de texto en LM sea la traducción de un segmento de texto en LO, asume que la traducción de un segmento es independiente de la traducción del resto de segmentos de la oración; es decir, asume que no es necesario tener en cuenta el contexto para traducir cada uno de los segmentos de la oración en LO.

source: Per exemple, el mot ``fondos'' apareix davant del mot ``estructurales'' 63 vegades de les 203 vegades que apareix ``estructurales'', és a dir, unes 3 de cada 10 vegades, quan a l'atzar apareixeria 410 vegades per cada 925.461, és a dir, unes 4 vegades cada 10.000.
es_es: Por ejemplo, la palabra ``fondos'' aparece ante la palabra ``estructurales'' 63 veces de las 203 veces que aparece ``estructurales'', es decir, unas 3 de cada 10 veces, cuando al azar aparecería 410 veces por cada 925.461, es decir, unas 4 veces cada 10.000.

source: Per exemple, els adjectius catalans van normalment darrere dels substantius mentre que els anglesos van normalment davant; traduir comporta, per tant, canviar els adjectius de posició.
es_es: Por ejemplo, los adjetivos catalanes van normalmente detrás de los sustantivos mientras que los ingleses van normalmente delante; traducir conlleva, por lo tanto, cambiar los adjetivos de posición.

source: Per exemple, en anglés tècnic, el mot replace presenta una ambigüitat lèxica (vegeu l'apartat ), ja que pot voler dir exchange (reemplaçar) o put back (tornar a col·locar).
es_es: Por ejemplo, en inglés técnico, la palabra replace presenta una ambigüedad léxica (véase el apartado ), puesto que puede querer decir exchange (reemplazar) o put back (volver a colocar).

source: Per exemple, en català diem Em dic Joan o Em diuen Joan; en anglés My name is Joan o I am called Joan; en alemany Ich heiße Joan, etc. En algunes llengües, trobem verbs que de vegades se solen anomenar ergatius, com ara en anglés el verb sink (enfonsar) quan porta subjecte i objecte, no és especial: el subjecte és l'agent i l'objecte el pacient: we sank the ship: enfonsar(agent=nosaltres,pacient=vaixell), però quan porta només un subjecte, aquest correspon al pacient de l'acció: the ship sinks enfonsar(pacient=vaixell), i l'agent sense especificar.
es_es: Por ejemplo, en catalán decimos Em dic Joan o Em diuen Joan; en inglés My name is Joan o I am called Joan; en alemán Ich heiße Joan, etc. En algunas lenguas, encontramos verbos que a veces se suelen llamar ergativos, como por ejemplo en inglés el verbo sink (hundirse) cuando lleva sujeto y objeto, no es especial: el sujeto es el agente y el objeto el paciente: we sank the ship: hundirse(agente=nosotros,paciente=barco), pero cuando lleva únicamente un sujeto, éste corresponde al paciente de la acción: the ship sinks hundirse(paciente=barco), y el agente sin especificar.

source: Per exemple, en molts casos és difícil aconseguir que l'ordinador sàpia elegir la interpretació correcta entre les possibles interpretacions d'un enunciat ambigu com Els soldats van disparar als xiquets.
es_es: Por ejemplo, en muchos casos es difícil conseguir que el ordenador sepa elegir la interpretación correcta entre las posibles interpretaciones de un enunciado ambiguo como Los soldados dispararon a los niños.

source: Per exemple, l'anàlisi morfològica de la forma superficial vius (ambigua) donaria com a resultat dues formes lèxiques: viure, verb, present d'indicatiu, 2a. persona del singular i viu, masculí, plural, on els lemes són, respectivament, viure i viu.
es_es: Por ejemplo, el análisis morfológico de la forma superficial vius (ambigua) daría como resultado dos formas léxicas: viure, verbo, presente de indicativo, 2a. persona del singular y viu, masculino, plural, donde los lemas son, respectivamente, viure y viu.

source: Per exemple, la qualitat del segment bilingüe (la comissió de balanços de finançament, the funding balance comission), on l'alineament entre els mots és la--the, comissió--comission, balanços--balance i finançament--funding, depén de les probabilitats de traducció dels mots que han estat alineats.
es_es: Por ejemplo, la calidad del segmento bilingüe (la comissió de balanços de finançament, the funding balance comission), donde el alineamiento entre las palabras es la--the, comissió--comission, balanços--balance y finançament--funding, depende de las probabilidades de traducción de las palabras que han sido alineadas.
